; SearchInEudic
; 
; ****************************************************************************************
; 
; 本脚本提供功能，选中后长按右键点按左键调用词典软件查词
; 
; ****************************************************************************************
;
; Created by ChiaWei
; version 0.01 alpha
; Updated: Feb 5, 2023
;
; ****************************************************************************************
;
; Code Start
;
; ****************************************************************************************

RButton::
{
	SetTimer mainc, 10       ; 10毫秒执行一次
}

mainc()
{
	if(!IsSet(counts)){
		global counts
		counts := 0
	}
	counts += 1
	if (counts > 30)
	{
		SetTimer mainc, False   ; 取消定时器
		SendInput "{F7}" ; F7为词典软件设置的查词快捷键
		counts := 0        ; 重置计数，清空变量，用于下次使用
		dict := ""
		Return
	}
	dict := GetKeyState("RButton", "P")      ; 获取鼠标右键的状态
	if(dict = False)   ; 当松开按键的时候
	{
		SetTimer mainc, False   ; 取消定时器
		if(counts < 31)   ; 如果counts在30以内，判断为短按。
		{
			SendInput "{RButton}"
		}
		counts := 0        ; 重置计数，清空变量，用于下次使用
		dict := ""
	}
}

; ****************************************************************************************